{
    "offset": 0,
    "title": "Resources: Pet Care | rosecityresource.org",
    "results": [
        {
            "zip": "97221-3550",
            "phone": "503-292-6628",
            "address": "5335 SW 42nd Ave.",
            "hours": "See website for event schedules.",
            "name": "Animal Aid",
            "url/_text": "http://www.animalaidpdx.org",
            "notes": "Animal Aid 5335 SW 42nd Ave. Portland OR 97221-3550 503-292-6628 http://www.animalaidpdx.org See website for event schedules. Spaying/neutering throughout the year: Spay Day USA; Tom & Mom Cat Special - $10 for each spay/neuter; offer interest-free loans so animal can receive immediate medical care, also loans for spay/neuter.",
            "url": "http://www.animalaidpdx.org",
            "city": "Portland"
        },
        {
            "zip": "97213",
            "phone": "503-232-2031",
            "address": "1435 NE 81st St.",
            "hours": "To make an appointment go to office Monday-Friday, 10 a.m.-3 p.m.",
            "name": "JOIN",
            "url/_text": "http://www.joinpdx.com",
            "notes": "JOIN 1435 NE 81st St. Portland OR 97213 503-232-2031 http://www.joinpdx.com To make an appointment go to office Monday-Friday, 10 a.m.-3 p.m. Transit: Max Blue, Green, Red, 72, 77 Usually has dog food available for people, occasionally has cat food. Provide access to local vet for free vaccination and spay/neuter services -stipulations: owner must be homeless, can get vaccinations if owner agrees to have animal spayed/neutered, owner must come to JOIN to set up appointment in person, no phone appointments.",
            "url": "http://www.joinpdx.com",
            "city": "Portland"
        },
        {
            "zip": "97211-1411",
            "phone": "503-285-7722 ext 211",
            "address": "1067 NE Columbia Blvd.",
            "name": "Oregon Humane Society",
            "url/_text": "http://www.oregonhumane.org",
            "notes": "Oregon Humane Society 1067 NE Columbia Blvd. Portland OR 97211-1411 503-285-7722 ext 211 http://www.oregonhumane.org Animals accepted for emergency boarding must be referred to OHS by owner's case worker, Red Cross or similar agency. Low cost spay/neuter coupons available for low income residents. Will distribute cat/dog food with valid ID.",
            "url": "http://www.oregonhumane.org",
            "city": "Portland"
        },
        {
            "zip": "97205-1702",
            "phone": "503-535-3844 message line",
            "address": "2700 NW Front Ave",
            "name": "PAW Team",
            "url/_text": "http://www.pawteam.org",
            "notes": "PAW Team 2700 NW Front Ave Portland OR 97205-1702 503-535-3844 message line http://www.pawteam.org For spay/neuter referral, deworming, flea treatments, vaccinations, pet care supplies and licensing. Date of clinics given on message line. Photo ID required. Clinics held first Sunday of month, except holidays. Clinics hours 10 a.m-2 p.m. Doors open 8 a.m., tickets given until noon.",
            "url": "http://www.pawteam.org",
            "city": "Portland"
        },
        {
            "name": "Portland Leash Law",
            "notes": "Portland Leash Law Portland has leash laws regarding pets on public property. Dogs are required to be on leashes unless they are in a designated off-leash area during off-leash hours. Pet owners must show they have immediate reach and control of their animal. Pet owners are required to scoop up and properly dispose of any fecal material animals leave in parks. Animals found in violation of city and county animal control regulations may be impounded, at the expense of the owner. Exceptions apply to service animals and police dogs."
        },
        {
            "phone": "Cat Adoption Team, 14175 SW Galbreath Drive, Sherwood, OR Phone: (503) 925-8903 Multnomah County Animal Services, 1700 W Columbia River Hwy, Troutdale, Phone: (503) 988-7387 Oregon Humane Society, 1067 NE Columbia Blvd. Portland, Phone: (503) 802-6755 For Stray or Feral Cats: Feral Cat Coalition of Oregon, Phone: (503) 797-2606",
            "hours": "Call the closest location to you to schedule your appointment:",
            "name": "Spay and Save",
            "url/_text": "http://www.asapmetro.org",
            "notes": "Spay and Save Cat Adoption Team, 14175 SW Galbreath Drive, Sherwood, OR Phone: (503) 925-8903 Multnomah County Animal Services, 1700 W Columbia River Hwy, Troutdale, Phone: (503) 988-7387 Oregon Humane Society, 1067 NE Columbia Blvd. Portland, Phone: (503) 802-6755 For Stray or Feral Cats: Feral Cat Coalition of Oregon, Phone: (503) 797-2606 http://www.asapmetro.org Call the closest location to you to schedule your appointment: Spay and Save program is an initiative of the Animal Shelter Alliance of Portland in which spay or neuter surgeries are offered to the cats of low income people for a fee of only $10. All cats are welcome, whether they are owned, stray or feral. To qualify, the person bringing in the cat(s) must be currently receiving government assistance such as Medicaid, WIC, Food Stamps, SSI, Section 8 public housing, AFDC, TANF or other government assistance programs. They must also be a resident of Multnomah, Washington, Clackamas or Clark Counties.",
            "url": "http://www.asapmetro.org"
        }
    ],
    "pageUrl": "http://www.rosecityresource.org/resources/pet-care"
}
